#### Student’s Full Name: Anmol Tripathi
#### Course Title: SQL/NoSQL Databases for Data and Information Sciences
#### Term name and year: Fall 2023
#### Submission Week: 7
#### Instructor’s Name: Nayem Rahman
#### Date of Submission : 04/11/2023

In [14]:
import sqlite3
import pandas as pd

In [15]:
Worker = "Worker.db"

In [16]:
conn = sqlite3.connect(Worker)

In [17]:
conn = sqlite3.connect('/Users/HP/OneDrive/Desktop/SQL/Worker.db')

In [18]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [19]:
%load_ext sql


%sql sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

#### 1. Write a single-row subquery to display EmployeeID, FirstName, LastName, and HireDate of employees hired after employee Vivek Pandey. Sort the results by EmployeeID. Make sure you show the print screen of the complete set of the rows and columns.

In [31]:
%%sql

SELECT EmployeeID, FirstName, LastName, HireDate
FROM Employee
WHERE HireDate > (SELECT HireDate FROM Employee WHERE FirstName = 'Vivek' AND LastName = 'Pandey')
ORDER BY EmployeeID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
   sqlite:///worker.db
Done.

[(2, 'John', 'Wilson', '2017-03-19'),
 (4, 'Nola', 'Davis', '2016-03-23'),
 (5, 'Kathy', 'Cooper', '2011-11-18'),
 (6, 'Tom', 'Harper', '2010-04-11')]

#### 2. Write a query to display FirstName, LastName, and TrainingName for employee Tom Harper. Sort the results by TrainingName.

In [32]:
%%sql

SELECT E.FirstName, E.LastName, T.TrainingName
FROM Employee E
INNER JOIN EmployeeTraining ET ON E.EmployeeID = ET.EmployeeID
INNER JOIN Training T ON ET.TrainingID = T.TrainingID
WHERE E.FirstName = 'Tom' AND E.LastName = 'Harper'
ORDER BY T.TrainingName;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
   sqlite:///worker.db
Done.

[('Tom', 'Harper', 'Code of Conduct Training'),
 ('Tom', 'Harper', 'Travel and Expense Management')]

#### 3. Write a query to display the complete list of Trainings, and trainers (first and last name as separate columns) available for each training. Sort the output by TrainingName and Trainers' first and last name. Make sure you show the print screen of the complete set of the rows and columns.

In [38]:
%%sql

SELECT T.TrainingID, T.TrainingName, TR.TrainerID, TR.TrainerFirstName, TR.TrainerLastName
FROM Training T
LEFT JOIN Trainer TR ON T.TrainingID = TR.TrainingID
ORDER BY T.TrainingName, TR.TrainerFirstName, TR.TrainerLastName;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
   sqlite:///worker.db
Done.

[(1, 'COVID-19 Awareness and Protection Training', 1, 'James', 'Smith'),
 (1, 'COVID-19 Awareness and Protection Training', 2, 'Johnny', 'Khor'),
 (2, 'Code of Conduct Training', 3, 'Michael', 'Smith'),
 (10, 'Employee Relations', 13, 'Mary', 'Garcia'),
 (10, 'Employee Relations', 14, 'Vanessa', None),
 (4, 'Intro to Python', 5, 'John', None),
 (4, 'Intro to Python', 6, 'Paul', 'Deitel'),
 (5, 'Machine Learning', 8, 'Avinash', 'Navlani'),
 (5, 'Machine Learning', 7, 'Mike', 'Taylor'),
 (6, 'Microsoft Certifications', 9, 'Robert', 'Smith'),
 (8, 'Product Knowledge', 11, 'Mike', 'Donlon'),
 (3, 'Safety Training', 4, 'Maria', 'Garcia'),
 (9, 'Sales Skills', 12, 'Kathy', 'Corby'),
 (7, 'Security and Privacy', 10, 'Maria', 'Rodriguez'),
 (11, 'Travel and Expense Management', 15, 'Jordan', None),
 (11, 'Travel and Expense Management', 16, 'Maria', 'Hernandez')]

#### 4. Write a multiple-row subquery to display EmployeeID, FirstName, LastName, and HireDate of employees who work for the following departments: Accounting and Finance, IT Support, and Production. Sort the results by EmployeeID. Make sure you show the print screen of the complete set of the rows and columns.

In [39]:
%%sql

SELECT EmployeeID, FirstName, LastName, HireDate
FROM Employee
WHERE DepartmentID IN (
    SELECT DepartmentID
    FROM Department
    WHERE DepartmentNm IN ('Accounting and Finance', 'IT Support', 'Production')
)
ORDER BY EmployeeID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
   sqlite:///worker.db
Done.

[(1, 'Andy', 'Wong', '2001-01-15'),
 (3, 'Vivek', 'Pandey', '2003-11-15'),
 (6, 'Tom', 'Harper', '2010-04-11')]

#### 5. Write a query to display the EmployeeID, FirstName, LastName, EquipmentName, and EquipmentCostAmount for two of the employees. Sort the results by EmployeeID. Make sure you show the print screen of the complete set of the rows and columns.

In [40]:
%%sql

SELECT E.EmployeeID, E.FirstName, E.LastName, EQ.EquipmentName, EQ.EquipmentCostAmount
FROM Employee E
INNER JOIN EmployeeEquipment EE ON E.EmployeeID = EE.EmployeeID
INNER JOIN Equipment EQ ON EE.EquipmentID = EQ.EquipmentID
WHERE E.EmployeeID IN (1, 2)
ORDER BY E.EmployeeID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
   sqlite:///worker.db
Done.

[(1, 'Andy', 'Wong', 'Notebook Computers', 1000),
 (2, 'John', 'Wilson', 'Notebook Computers', 1000),
 (2, 'John', 'Wilson', 'Computer Monitor', 1500)]

#### 6. Write a query to display the TrainingID, TrainingName, TrainerID, TrainerFirstName, and TrainerLastName with the trainers who did not provide their last name. Sort the results by TrainingID and TrainerID. Make sure you show the print screen of the complete set of the rows and columns.

In [41]:
%%sql

SELECT T.TrainingID, T.TrainingName, TR.TrainerID, TR.TrainerFirstName, TR.TrainerLastName
FROM Training T
INNER JOIN Trainer TR ON T.TrainingID = TR.TrainingID
WHERE TR.TrainerLastName IS NULL
ORDER BY T.TrainingID, TR.TrainerID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
   sqlite:///worker.db
Done.

[(4, 'Intro to Python', 5, 'John', None),
 (10, 'Employee Relations', 14, 'Vanessa', None),
 (11, 'Travel and Expense Management', 15, 'Jordan', None)]

#### 7. Write a query to display the distinct list of equipments used by the current employees. Sort the output by EquipmentName. Make sure you show the print screen of the complete set of the rows and columns.

In [42]:
%%sql

SELECT DISTINCT EQ.EquipmentID, EQ.EquipmentName, EQ.EquipmentCostAmount
FROM Equipment EQ
INNER JOIN EmployeeEquipment EE ON EQ.EquipmentID = EE.EquipmentID
ORDER BY EQ.EquipmentName;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
   sqlite:///worker.db
Done.

[(3, 'Computer Monitor', 1500),
 (2, 'Headsets', 200),
 (1, 'Notebook Computers', 1000)]

#### 8. Write a query to display the FirstName, LastName, TrainingName, and trainer(s) (with first and last name in two separate columns) for two of the employees. Sort the results by employee LastName and TrainingName. Make sure you show the print screen of the complete set of the rows and columns.

In [43]:
%%sql

SELECT E.FirstName, E.LastName, T.TrainingName, TR.TrainerFirstName, TR.TrainerLastName
FROM Employee E
INNER JOIN EmployeeTraining ET ON E.EmployeeID = ET.EmployeeID
INNER JOIN Training T ON ET.TrainingID = T.TrainingID
LEFT JOIN Trainer TR ON T.TrainingID = TR.TrainingID
WHERE E.EmployeeID IN (1, 2)
ORDER BY E.LastName, T.TrainingName;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
   sqlite:///worker.db
Done.

[('John', 'Wilson', 'Code of Conduct Training', 'Michael', 'Smith'),
 ('John', 'Wilson', 'Intro to Python', 'John', None),
 ('John', 'Wilson', 'Intro to Python', 'Paul', 'Deitel'),
 ('John', 'Wilson', 'Machine Learning', 'Mike', 'Taylor'),
 ('John', 'Wilson', 'Machine Learning', 'Avinash', 'Navlani'),
 ('Andy', 'Wong', 'Code of Conduct Training', 'Michael', 'Smith'),
 ('Andy', 'Wong', 'Safety Training', 'Maria', 'Garcia')]

#### 9. Write a query to display the EmployeeID, FirstName, LastName, DepartmentID, DepartmentName, EquipmentID, EquipmentName for all employees. Sort the results by EmployeeID, DepartmentID, and EquipmentID. Make sure you show the print screen of the complete set of the rows and columns.

In [44]:
%%sql

SELECT E.EmployeeID, E.FirstName, E.LastName, E.DepartmentID, D.DepartmentNm, EQ.EquipmentID, EQ.EquipmentName
FROM Employee E
INNER JOIN Department D ON E.DepartmentID = D.DepartmentID
LEFT JOIN EmployeeEquipment EE ON E.EmployeeID = EE.EmployeeID
LEFT JOIN Equipment EQ ON EE.EquipmentID = EQ.EquipmentID
ORDER BY E.EmployeeID, E.DepartmentID, EQ.EquipmentID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
   sqlite:///worker.db
Done.

[(1, 'Andy', 'Wong', 2, 'Production', 1, 'Notebook Computers'),
 (2, 'John', 'Wilson', 1, 'Research & Development', 1, 'Notebook Computers'),
 (2, 'John', 'Wilson', 1, 'Research & Development', 3, 'Computer Monitor'),
 (3, 'Vivek', 'Pandey', 3, 'IT Support', 1, 'Notebook Computers'),
 (3, 'Vivek', 'Pandey', 3, 'IT Support', 2, 'Headsets'),
 (3, 'Vivek', 'Pandey', 3, 'IT Support', 3, 'Computer Monitor'),
 (4, 'Nola', 'Davis', 7, 'Sales & Marketing', 1, 'Notebook Computers'),
 (4, 'Nola', 'Davis', 7, 'Sales & Marketing', 2, 'Headsets'),
 (5, 'Kathy', 'Cooper', 8, 'Human Resource Management', 1, 'Notebook Computers'),
 (5, 'Kathy', 'Cooper', 8, 'Human Resource Management', 2, 'Headsets'),
 (5, 'Kathy', 'Cooper', 8, 'Human Resource Management', 3, 'Computer Monitor'),
 (6, 'Tom', 'Harper', 9, 'Accounting and Finance', 1, 'Notebook Computers'),
 (6, 'Tom', 'Harper', 9, 'Accounting and Finance', 3, 'Computer Monitor')]

#### 10. Write a query to display the EmployeeID, FirstName, LastName, DepartmentID, DepartmentName, TrainingID, TrainingName for all employees. Sort the results by EmployeeID, DepartmentID, and TrainingID. Make sure you show the print screen of the complete set of the rows and columns.

In [45]:
%%sql

SELECT E.EmployeeID, E.FirstName, E.LastName, E.DepartmentID, D.DepartmentNm, T.TrainingID, T.TrainingName
FROM Employee E
INNER JOIN Department D ON E.DepartmentID = D.DepartmentID
LEFT JOIN EmployeeTraining ET ON E.EmployeeID = ET.EmployeeID
LEFT JOIN Training T ON ET.TrainingID = T.TrainingID
ORDER BY E.EmployeeID, E.DepartmentID, T.TrainingID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
   sqlite:///worker.db
Done.

[(1, 'Andy', 'Wong', 2, 'Production', 2, 'Code of Conduct Training'),
 (1, 'Andy', 'Wong', 2, 'Production', 3, 'Safety Training'),
 (2, 'John', 'Wilson', 1, 'Research & Development', 2, 'Code of Conduct Training'),
 (2, 'John', 'Wilson', 1, 'Research & Development', 4, 'Intro to Python'),
 (2, 'John', 'Wilson', 1, 'Research & Development', 5, 'Machine Learning'),
 (3, 'Vivek', 'Pandey', 3, 'IT Support', 2, 'Code of Conduct Training'),
 (3, 'Vivek', 'Pandey', 3, 'IT Support', 6, 'Microsoft Certifications'),
 (3, 'Vivek', 'Pandey', 3, 'IT Support', 7, 'Security and Privacy'),
 (4, 'Nola', 'Davis', 7, 'Sales & Marketing', 2, 'Code of Conduct Training'),
 (4, 'Nola', 'Davis', 7, 'Sales & Marketing', 8, 'Product Knowledge'),
 (4, 'Nola', 'Davis', 7, 'Sales & Marketing', 9, 'Sales Skills'),
 (5, 'Kathy', 'Cooper', 8, 'Human Resource Management', 2, 'Code of Conduct Training'),
 (5, 'Kathy', 'Cooper', 8, 'Human Resource Management', 10, 'Employee Relations'),
 (6, 'Tom', 'Harper', 9, 'Accounting and Finance', 2, 'Code of Conduct Training'),
 (6, 'Tom', 'Harper', 9, 'Accounting and Finance', 11, 'Travel and Expense Management')]